[
    {
      "bookId": 1,
      "bookName": "The Dating Playboy For Men",
      "author": "Andrew Ferebee",
      "image": "https://i.ibb.co/VDmrQCt/pngwing-1.png",
      "review": "The Dating Playbook for Men by Andrew Ferebee offers practical guidance for men seeking to improve their dating lives. Ferebee provides valuable insights on building confidence, approaching women, and fostering meaningful connections. The book emphasizes self-improvement, encouraging readers to cultivate their interests and social skills. It covers various aspects of dating, including flirting, communication, and navigating online dating platforms. Ferebee's advice is clear, actionable, and rooted in respect for others' feelings and boundaries. While primarily focused on dating, the book also touches on building healthy long-term relationships. Overall, The Dating Playbook for Men serves as a comprehensive resource for men looking to enhance their romantic relationships, offering valuable strategies and techniques for success in the dating world.",
      "totalPages": 320,
      "rating": 4.5,
      "category": "Self-help",
      "tags": ["Dating Advice", "Mens Relationship Guide"],
      "publisher": "Scribner",
      "yearOfPublishing": 2015
    },
    {
      "bookId": 2,
      "bookName": "Why Do You Hate Money",
      "author": "Joey Percia",
      "image": "https://i.ibb.co/txjfqsL/kindpng-7318921.png",
      "review": "Why Do You Hate Money by Joey Percia delves into the psychological aspects behind our relationship with money. Percia offers insightful analysis and practical strategies to help readers overcome their money-related anxieties and achieve financial success. Through engaging anecdotes and relatable examples, he addresses common money pitfalls and provides actionable steps to cultivate a healthier mindset towards wealth. Percia's approachable writing style makes complex financial concepts accessible to readers of all levels of financial literacy. Ultimately, Why Do You Hate Money serves as a valuable resource for anyone looking to break free from negative money patterns and build a more prosperous future.",
      "totalPages": 216,
      "rating": 4.8,
      "category": "Self-help",
      "tags": ["Personal Finance", "Mindset Shifts"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 2017
    },
    {
      "bookId": 3,
      "bookName": "The Heat You Give",
      "author": "Angie Thomas",
      "image": "https://i.ibb.co/bF7WKrP/kindpng-1064993.png",
      "review": "The Hate U Give by Angie Thomas is a gripping and timely novel that follows the story of Starr Carter, a black teenager who witnesses the police shooting of her unarmed friend. Through Starr's perspective, Thomas navigates complex themes of racial injustice, systemic oppression, and the challenges of finding one's voice in the face of adversity. The book tackles these weighty topics with sensitivity and authenticity, capturing the raw emotions and tensions of contemporary society. With its compelling narrative and relatable characters, The Hate U Give is not only a thought-provoking read but also a catalyst for important conversations about race and social justice.",
      "totalPages": 464,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Young Adult Fiction", "Social Justice"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 2017
    },
    {
      "bookId": 4,
      "bookName": "The Scholarship Monthly Planner",
      "author": "Marianne Ragins",
      "image": "https://i.ibb.co/ZcN2Bv2/kindpng-4022054-1.png",
      "review": "The Scholarship Monthly Planner by Marianne Ragins provides students with a comprehensive tool to navigate the scholarship application process. Ragins, herself a scholarship recipient who won over $400,000 in scholarships to fund her education, shares her expertise and insights to assist students in securing funding for their academic pursuits. The planner includes monthly calendars, checklists, and tips for researching scholarships, organizing application materials, and meeting deadlines. With its structured approach and valuable resources, this planner empowers students to maximize their chances of success in securing scholarships to support their education.",
      "totalPages": 28,
      "rating": 4.3,
      "category": "Education",
      "tags": ["Academic Planning", "Scholarship Applications"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 2017
    },
    {
      "bookId": 5,
      "bookName": "Annotated Texas Family Code 2019",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/hCjXDt0/kindpng-81724-1.png",
      "review": "Annotated Texas Family Code 2019 provides a comprehensive and accessible resource for legal professionals, scholars, and individuals seeking to understand family law in the state of Texas. This edition includes the complete text of the Texas Family Code along with annotations that offer valuable insights, case law references, and explanatory notes. The annotations provide context and interpretation, helping readers navigate complex legal concepts and understand how the law has been applied in practice. With cross-references to related statutes and expert commentary, this book serves as an indispensable tool for anyone working in the field of family law or dealing with legal issues related to family matters in Texas.",
      "totalPages": 279,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Family Law", "Legal Annotations"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 2019
    },
    {
        "bookId": 6,
        "bookName": "Loving Jesus More",
        "author": "John Loren Sandford",
        "image": "https://i.ibb.co/f9Jg37V/kindpng-2193744-1.png",
        "review": "Loving Jesus More by Knowing the Customs and Culture of His Time is a book that aims to deepen readers' understanding of Jesus Christ and his teachings by exploring the customs and culture of the time in which he lived. The book likely delves into historical and cultural contexts surrounding Jesus' life, providing insights into the social, religious, and political dynamics of first-century Palestine. By examining these contexts, readers can gain a richer appreciation for the messages and actions of Jesus as portrayed in the New Testament. The book may offer fresh perspectives on familiar biblical narratives and encourage readers to apply the lessons learned to their own spiritual journeys.",
        "totalPages": 310,
        "rating": 4.9,
        "category": "Christian literature",
        "tags": ["Biblical Studies", "Cultural Context"],
        "publisher": "BT Johnson Publishing",
        "yearOfPublishing": 1937
      }
]      
